      * This is identical to COPY_STATEMENT_CHAIN to show the
      * relationship between chains is not duplicated.
000000 IDENTIFICATION DIVISION.                                         *
       PROGRAM-ID. COPY_STATEMENT_CHAIN.                                *
       DATA DIVISION.                                                   *
       LINKAGE SECTION.                                                 *
           01  GRP-01.                                                  *
               COPY INCEPTION.                                          *